{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v2.3.0", "userDefinedMetadata": {"signature": {"inputs": {"input:0": {"name": "input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "200"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}}, "modelTopology": {"node": [{"name": "unknown_16", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/ffn/dense_22/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/ffn/dense_22/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/ffn/dense_22/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/ffn/dense_22/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_13", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/ffn/dense_21/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/ffn/dense_21/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/ffn/dense_21/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/ffn/dense_21/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_10", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/combine/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/combine/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/combine/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/combine/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "unknown_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape/shape/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_4", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape_1/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape_1/shape/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape_1/shape/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "unknown_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_6", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape_2/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape_2/shape/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape_2/shape/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/transpose_2/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/transpose_3/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20000"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/embedding/token_embed/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/embedding/range/start", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_14/embedding/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/embedding/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/embedding/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/embedding/range/delta", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_14/embedding/position_embed/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape_3/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape_3/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/combine/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/combine/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/combine/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/combine/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "unknown_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/layernorm1/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/layernorm1/moments/variance/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/layernorm1/batchnorm/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "unknown_9", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/ffn/dense_21/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/ffn/dense_21/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/ffn/dense_21/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/ffn/dense_21/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "unknown_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/ffn/dense_22/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/ffn/dense_22/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/ffn/dense_22/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/ffn/dense_22/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_14", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/layernorm2/moments/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/layernorm2/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/layernorm2/batchnorm/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_15", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14/gap1d/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "unknown_17", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_18", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}]}}}}}, {"name": "unknown_19", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_20", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "200"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14/embedding/token_embed/Cast", "op": "Cast", "input": ["input"], "attr": {"DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14/embedding/Shape", "op": "Shape", "input": ["input"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14/embedding/token_embed/embedding_lookup", "op": "GatherV2", "input": ["unknown_0", "StatefulPartitionedCall/functional_14/embedding/token_embed/Cast", "StatefulPartitionedCall/functional_14/embedding/token_embed/embedding_lookup/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/embedding/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_14/embedding/Shape", "StatefulPartitionedCall/functional_14/embedding/strided_slice/stack", "StatefulPartitionedCall/functional_14/embedding/strided_slice/stack_1", "StatefulPartitionedCall/functional_14/embedding/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/embedding/range", "op": "Range", "input": ["StatefulPartitionedCall/functional_14/embedding/range/start", "StatefulPartitionedCall/functional_14/embedding/strided_slice", "StatefulPartitionedCall/functional_14/embedding/range/delta"], "attr": {"Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/embedding/position_embed/embedding_lookup", "op": "GatherV2", "input": ["unknown", "StatefulPartitionedCall/functional_14/embedding/range", "StatefulPartitionedCall/functional_14/embedding/position_embed/embedding_lookup/axis"], "attr": {"batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14/embedding/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_14/embedding/token_embed/embedding_lookup", "StatefulPartitionedCall/functional_14/embedding/position_embed/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/functional_14/embedding/add"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/functional_14/embedding/add"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/functional_14/embedding/add"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/functional_14/embedding/add"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/Shape", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/axes", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/GatherV2_1/axis"], "attr": {"Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/Shape", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/free", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/Shape", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/axes", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/Shape", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/free", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/Shape", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/axes", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/GatherV2_1/axis"], "attr": {"Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/Shape", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/free", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/GatherV2/axis"], "attr": {"Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Shape", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/strided_slice/stack", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/strided_slice/stack_1", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/GatherV2_1", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/Const_1"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/GatherV2", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/Const"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/GatherV2", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/Const_2", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/concat_1/axis"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/GatherV2_1", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/Const_1"], "attr": {"keep_dims": {"b": false}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/GatherV2", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/Const"], "attr": {"keep_dims": {"b": false}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/GatherV2", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/Const_2", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/GatherV2_1", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/Const_1"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/GatherV2", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/GatherV2", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/Const_2", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/concat_1/axis"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/strided_slice", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape/shape/1", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape/shape/2", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape/shape/3"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape_1/shape", "op": "Pack", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/strided_slice", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape_1/shape/1", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape_1/shape/2", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape_1/shape/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape_2/shape", "op": "Pack", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/strided_slice", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape_2/shape/1", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape_2/shape/2", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape_2/shape/3"], "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape_3/shape", "op": "Pack", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/strided_slice", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape_3/shape/1", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape_3/shape/2"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/Prod", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/Prod_1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/Prod", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/Prod_1"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/Prod", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/Prod_1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_14/embedding/add", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_14/embedding/add", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/stack"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_14/embedding/add", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/stack"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/Reshape", "unknown_1"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/Reshape", "unknown_3"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/Reshape", "unknown_5"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/MatMul", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/MatMul", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot/concat_1"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/MatMul", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot/concat_1"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/Tensordot", "unknown_2"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/Tensordot", "unknown_4"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/Tensordot", "unknown_6"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/query/BiasAdd", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/key/BiasAdd", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape_2", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/value/BiasAdd", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape_2/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape_1", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/transpose_2", "op": "Transpose", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape_2", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/transpose_2/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/transpose", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/transpose_1"], "attr": {"adj_x": {"b": false}, "adj_y": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/transpose_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Shape_1", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/strided_slice_1/stack", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/strided_slice_1/stack_1", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/strided_slice_1/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/strided_slice_1"], "attr": {"SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Sqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/MatMul", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Sqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/MatMul_1", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Softmax", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/transpose_2"], "attr": {"adj_y": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_x": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/transpose_3", "op": "Transpose", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/MatMul_1", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/transpose_3/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape_3", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/transpose_3", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape_3/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/combine/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/Reshape_3"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/combine/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/combine/Tensordot/Shape", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/combine/Tensordot/axes", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/combine/Tensordot/GatherV2_1/axis"], "attr": {"batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/combine/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/combine/Tensordot/Shape", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/combine/Tensordot/free", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/combine/Tensordot/GatherV2/axis"], "attr": {"batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/combine/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/combine/Tensordot/GatherV2_1", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/combine/Tensordot/Const_1"], "attr": {"T": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/combine/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/combine/Tensordot/GatherV2", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/combine/Tensordot/Const"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/combine/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/combine/Tensordot/GatherV2", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/combine/Tensordot/Const_2", "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/combine/Tensordot/concat_1/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14/transformer/multiHeadAttn/combine/Tensordot/stack", "op": "Pack", "input": 